ebpf_research/results/raw/wrk2_adv_baseline_v1_r30000_1779424224.log
Running 1m test @ http://10.200.6.2:9090/
  2 threads and 100 connections
  Thread calibration: mean lat.: 5277.799ms, rate sampling interval: 17711ms
  Thread calibration: mean lat.: 5373.737ms, rate sampling interval: 17760ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.94s    13.76s    0.95m    58.33%
    Req/Sec   720.00     40.59   762.00     50.00%
  93942 requests in 1.00m, 12.64MB read
  Socket errors: connect 0, read 0, write 0, timeout 30
Requests/sec:   1565.67
Transfer/sec:    215.79KB
Target QPS: 30000
Actual QPS: rate
p50: 38305791us
p95: 54984703us
p99: 56393727us
p99.9: 56754175us
RESULT target_qps=30000 actual_qps=rate p50_us=38305791 p95_us=54984703 p99_us=56393727 p999_us=56754175