ebpf_research/results/raw/wrk2_adv_baseline_v5_r37500_1779428856.log
Running 1m test @ http://10.200.6.2:9090/
  2 threads and 100 connections
  Thread calibration: mean lat.: 4975.751ms, rate sampling interval: 16072ms
  Thread calibration: mean lat.: 4746.609ms, rate sampling interval: 17154ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.60s    13.54s    0.94m    57.77%
    Req/Sec     1.08k     0.89     1.08k   100.00%
  126815 requests in 1.00m, 17.06MB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:   2113.51
Transfer/sec:    291.22KB
Target QPS: 37500
Actual QPS: rate
p50: 32604159us
p95: 53706751us
p99: 55607295us
p99.9: 56360959us
RESULT target_qps=37500 actual_qps=rate p50_us=32604159 p95_us=53706751 p99_us=55607295 p999_us=56360959