ebpf_research/results/raw/wrk2_adv_baseline_v5_r45000_1779429041.log
Running 1m test @ http://10.200.6.2:9090/
  2 threads and 100 connections
  Thread calibration: mean lat.: 4978.969ms, rate sampling interval: 16187ms
  Thread calibration: mean lat.: 4789.316ms, rate sampling interval: 17350ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.94s    13.69s    0.95m    57.83%
    Req/Sec     1.07k     1.67     1.08k   100.00%
  126340 requests in 1.00m, 17.00MB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:   2105.58
Transfer/sec:    290.14KB
Target QPS: 45000
Actual QPS: rate
p50: 32948223us
p95: 54263807us
p99: 56164351us
p99.9: 56950783us
RESULT target_qps=45000 actual_qps=rate p50_us=32948223 p95_us=54263807 p99_us=56164351 p999_us=56950783