ebpf_research/results/raw/wrk2_adv_isolated_v1_r30000_1779424965.log
Running 1m test @ http://10.200.6.2:9090/
  2 threads and 100 connections
  Thread calibration: mean lat.: 4666.797ms, rate sampling interval: 16908ms
  Thread calibration: mean lat.: 4983.727ms, rate sampling interval: 15958ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.13s    13.33s    0.93m    57.85%
    Req/Sec     1.07k     1.02     1.07k   100.00%
  125540 requests in 1.00m, 16.89MB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:   2092.23
Transfer/sec:    288.30KB
Target QPS: 30000
Actual QPS: rate
p50: 32145407us
p95: 52920319us
p99: 54788095us
p99.9: 55508991us
RESULT target_qps=30000 actual_qps=rate p50_us=32145407 p95_us=52920319 p99_us=54788095 p999_us=55508991