ebpf_research/results/raw/wrk2_adv_isolated_v5_r45000_1779429783.log
Running 1m test @ http://10.200.6.2:9090/
  2 threads and 100 connections
  Thread calibration: mean lat.: 4963.302ms, rate sampling interval: 16326ms
  Thread calibration: mean lat.: 5135.749ms, rate sampling interval: 16424ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.37s    13.61s    0.98m    58.17%
    Req/Sec     0.87k    91.00     1.01k    50.00%
  97507 requests in 1.00m, 13.12MB read
  Socket errors: connect 0, read 0, write 0, timeout 623
Requests/sec:   1625.11
Transfer/sec:    223.94KB
Target QPS: 45000
Actual QPS: rate
p50: 33718271us
p95: 54263807us
p99: 56098815us
p99.9: 58261503us
RESULT target_qps=45000 actual_qps=rate p50_us=33718271 p95_us=54263807 p99_us=56098815 p999_us=58261503