ebpf_research/results/raw/wrk2_adv_shared_v5_r32500_1779430216.log
Running 1m test @ http://10.200.6.2:9090/
  2 threads and 100 connections
  Thread calibration: mean lat.: 5047.868ms, rate sampling interval: 16146ms
  Thread calibration: mean lat.: 4907.487ms, rate sampling interval: 15982ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.97s    13.41s    0.93m    57.77%
    Req/Sec     1.08k     0.82     1.08k   100.00%
  123562 requests in 1.00m, 16.63MB read
  Socket errors: connect 0, read 0, write 0, timeout 22
Requests/sec:   2059.29
Transfer/sec:    283.76KB
Target QPS: 32500
Actual QPS: rate
p50: 31965183us
p95: 52887551us
p99: 54722559us
p99.9: 55181311us
RESULT target_qps=32500 actual_qps=rate p50_us=31965183 p95_us=52887551 p99_us=54722559 p999_us=55181311