ebpf_research/results/raw/wrk2_v1_of_1_shared_0_1779424269.log
Running 1m test @ http://10.200.1.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.988ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 251.080ms, rate sampling interval: 1902ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.82ms    6.03ms  23.58ms   67.73%
    Req/Sec   103.49    110.39   555.00     84.33%
  11902 requests in 1.00m, 1.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:    198.36
Transfer/sec:     27.32KB
Target QPS: 200
Actual QPS: rate
p50: 4835us
p95: 16767us
p99: 18511us
p99.9: 22047us
RESULT target_qps=200 actual_qps=rate p50_us=4835 p95_us=16767 p99_us=18511 p999_us=22047