ebpf_research/results/raw/wrk2_v1_of_1_shared_0_1779425398.log
Running 1m test @ http://10.200.1.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.556ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.586ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.57ms  461.27us   3.12ms   67.26%
    Req/Sec   105.14    108.47   333.00     77.76%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.02
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1582us
p95: 2333us
p99: 2583us
p99.9: 2805us
RESULT target_qps=200 actual_qps=rate p50_us=1582 p95_us=2333 p99_us=2583 p999_us=2805