ebpf_research/results/raw/wrk2_v1_of_3_isolated_42500_1779427497.log
Running 1m test @ http://10.200.1.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.382ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.372ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.36ms  424.05us   2.88ms   66.58%
    Req/Sec   104.71    107.54   333.00     78.82%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.03
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1358us
p95: 2059us
p99: 2359us
p99.9: 2639us
RESULT target_qps=200 actual_qps=rate p50_us=1358 p95_us=2059 p99_us=2359 p999_us=2639