ebpf_research/results/raw/wrk2_v1_of_3_isolated_45000_1779427559.log
Running 1m test @ http://10.200.1.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.397ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 326.730ms, rate sampling interval: 2461ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.56ms    4.65ms  15.62ms   62.00%
    Req/Sec   102.81    108.76   500.00     86.50%
  11902 requests in 1.00m, 1.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 7
Requests/sec:    198.35
Transfer/sec:     27.32KB
Target QPS: 200
Actual QPS: rate
p50: 3931us
p95: 12727us
p99: 13799us
p99.9: 14999us
RESULT target_qps=200 actual_qps=rate p50_us=3931 p95_us=12727 p99_us=13799 p999_us=14999