ebpf_research/results/raw/wrk2_v1_of_5_isolated_25000_1779429289.log
Running 1m test @ http://10.200.1.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.335ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 267.663ms, rate sampling interval: 1937ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.37ms    4.53ms  15.71ms   65.92%
    Req/Sec   102.58    107.35   444.00     88.32%
  11902 requests in 1.00m, 1.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:    198.36
Transfer/sec:     27.32KB
Target QPS: 200
Actual QPS: rate
p50: 3521us
p95: 12479us
p99: 13655us
p99.9: 14919us
RESULT target_qps=200 actual_qps=rate p50_us=3521 p95_us=12479 p99_us=13655 p999_us=14919