ebpf_research/results/raw/wrk2_v2_of_3_baseline_37500_1779426632.log
Running 1m test @ http://10.200.2.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.324ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.332ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.33ms  441.00us   2.87ms   66.63%
    Req/Sec   104.51    107.41   333.00     80.03%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.03
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1327us
p95: 2081us
p99: 2417us
p99.9: 2701us
RESULT target_qps=200 actual_qps=rate p50_us=1327 p95_us=2081 p99_us=2417 p999_us=2701