ebpf_research/results/raw/wrk2_v2_of_3_shared_20000_1779427744.log
Running 1m test @ http://10.200.2.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.354ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.366ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.35ms  432.83us   2.84ms   65.97%
    Req/Sec   104.43    106.83   333.00     80.49%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.03
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1354us
p95: 2073us
p99: 2333us
p99.9: 2565us
RESULT target_qps=200 actual_qps=rate p50_us=1354 p95_us=2073 p99_us=2333 p999_us=2565