ebpf_research/results/raw/wrk2_v2_of_5_isolated_32500_1779429474.log
Running 1m test @ http://10.200.2.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.352ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 382.834ms, rate sampling interval: 2676ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.34ms    4.65ms  15.58ms   70.70%
    Req/Sec   102.69    107.74   500.00     87.44%
  11902 requests in 1.00m, 1.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 9
Requests/sec:    198.34
Transfer/sec:     27.31KB
Target QPS: 200
Actual QPS: rate
p50: 2551us
p95: 12911us
p99: 13991us
p99.9: 15031us
RESULT target_qps=200 actual_qps=rate p50_us=2551 p95_us=12911 p99_us=13991 p999_us=15031