ebpf_research/results/raw/wrk2_v2_of_5_shared_37500_1779430339.log
Running 1m test @ http://10.200.2.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.281ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.303ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.29ms  419.70us   2.98ms   65.86%
    Req/Sec   103.97    106.43   333.00     82.13%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.03
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1286us
p95: 1998us
p99: 2281us
p99.9: 2597us
RESULT target_qps=200 actual_qps=rate p50_us=1286 p95_us=1998 p99_us=2281 p999_us=2597