ebpf_research/results/raw/wrk2_v3_of_3_baseline_10000_1779426200.log
Running 1m test @ http://10.200.3.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.313ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.349ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.32ms  437.76us   2.81ms   65.76%
    Req/Sec   104.20    107.17   333.00     81.20%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.03
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1300us
p95: 2077us
p99: 2361us
p99.9: 2625us
RESULT target_qps=200 actual_qps=rate p50_us=1300 p95_us=2077 p99_us=2361 p999_us=2625