ebpf_research/results/raw/wrk2_v3_of_3_baseline_25000_1779426324.log
Running 1m test @ http://10.200.3.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.362ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.350ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.36ms  418.07us   2.81ms   67.10%
    Req/Sec   104.57    106.99   333.00     79.93%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.02
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1370us
p95: 2046us
p99: 2341us
p99.9: 2589us
RESULT target_qps=200 actual_qps=rate p50_us=1370 p95_us=2046 p99_us=2341 p999_us=2589