ebpf_research/results/raw/wrk2_v3_of_3_baseline_27500_1779426385.log
Running 1m test @ http://10.200.3.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.402ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 340.050ms, rate sampling interval: 2654ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.37ms    4.62ms  15.71ms   69.09%
    Req/Sec   102.83    108.21   444.00     87.05%
  11902 requests in 1.00m, 1.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 7
Requests/sec:    198.36
Transfer/sec:     27.32KB
Target QPS: 200
Actual QPS: rate
p50: 2577us
p95: 12759us
p99: 13903us
p99.9: 14847us
RESULT target_qps=200 actual_qps=rate p50_us=2577 p95_us=12759 p99_us=13903 p999_us=14847